In [2]:
from cassandra.cluster import Cluster
from cassandra.auth import PlainTextAuthProvider

In [5]:
cloud_config= {
        'secure_connect_bundle': 'E:\secure-connect-test.zip'
}
auth_provider = PlainTextAuthProvider('QnitnoceucekGFGZdIJHWsGl', 'beSYGsqhRbRl4Too-vwy.Z286IZq0m7rHx-kU8zY-9bj9xcHHTPduuSwQZNe6KTnhmBILWZfWSaG039_+n+_73M2qUFpvZd9YzcU6qYIkXl9GgigpwDpHBBd+.yNFr4a')
cluster = Cluster(cloud=cloud_config, auth_provider=auth_provider)
session = cluster.connect()

row = session.execute("select release_version from system.local").one()
if row:
    print(row[0])
else:
    print("An error occurred.")

4.0.0.6813

# create table inside keyspace

In [10]:

row = session.execute("CREATE TABLE sg.emp(e_id INT PRIMARY KEY,e_name VARCHAR,dob DATE,dept VARCHAR,city VARCHAR,salary DECIMAL);").one()
print(row)

None

# insert data

In [19]:
row = session.execute("INSERT INTO sg.emp(e_id ,e_name,dob ,dept ,city,salary ) VALUES (1,'vini','2000-02-02','IT','dehradun',6500);").one()
print(row)

None

In [21]:
row = session.execute("INSERT INTO sg.emp(e_id ,e_name,dob ,dept ,city,salary ) VALUES (2,'anu','2000-02-03','IT','uttarakhand',7500);").one()
row = session.execute("INSERT INTO sg.emp(e_id ,e_name,dob ,dept ,city,salary ) VALUES (3,'windy','2002-03-19','marketting','delhi',4500);").one()
row = session.execute("INSERT INTO sg.emp(e_id ,e_name,dob ,dept ,city,salary ) VALUES (4,'tom','2005-06-22','IT','mumbai',6500);").one()
row = session.execute("INSERT INTO sg.emp(e_id ,e_name,dob ,dept ,city,salary ) VALUES (5,'jerry','2000-10-15','Accountant','banglore',7500);").one()
row = session.execute("INSERT INTO sg.emp(e_id ,e_name,dob ,dept ,city,salary ) VALUES (6,'joy','2004-08-13','HR','chennai',1500);").one()
row = session.execute("INSERT INTO sg.emp(e_id ,e_name,dob ,dept ,city,salary ) VALUES (7,'oswald','1999-01-12','marketting','kolkata',35);").one()
print(row)

None

# display all records

In [25]:
row = session.execute("SELECT * FROM sg.emp;").all()
for i in row:
    print(i)

Row(e_id=5, city='banglore', dept='Accountant', dob=Date(11245), e_name='jerry', salary=Decimal('7500'))
Row(e_id=1, city='dehradun', dept='IT', dob=Date(10989), e_name='vini', salary=Decimal('6500'))
Row(e_id=2, city='uttarakhand', dept='IT', dob=Date(10990), e_name='anu', salary=Decimal('7500'))
Row(e_id=4, city='mumbai', dept='IT', dob=Date(12956), e_name='tom', salary=Decimal('6500'))
Row(e_id=7, city='kolkata', dept='marketting', dob=Date(10603), e_name='oswald', salary=Decimal('35'))
Row(e_id=6, city='chennai', dept='HR', dob=Date(12643), e_name='joy', salary=Decimal('1500'))
Row(e_id=3, city='delhi', dept='marketting', dob=Date(11765), e_name='windy', salary=Decimal('4500'))

# delete specific record

In [36]:
row = session.execute("DELETE  FROM sg.emp  WHERE e_id=4;").one()

In [37]:
row = session.execute("SELECT * FROM sg.emp;").all()
for i in row:
    print(i)

Row(e_id=5, city='banglore', dept='Accountant', dob=Date(11245), e_name='jerry', salary=Decimal('7500'))
Row(e_id=1, city='dehradun', dept='IT', dob=Date(10989), e_name='vini', salary=Decimal('6500'))
Row(e_id=2, city='uttarakhand', dept='IT', dob=Date(10990), e_name='anu', salary=Decimal('7500'))
Row(e_id=7, city='kolkata', dept='marketting', dob=Date(10603), e_name='oswald', salary=Decimal('35'))
Row(e_id=6, city='chennai', dept='HR', dob=Date(12643), e_name='joy', salary=Decimal('1500'))
Row(e_id=3, city='delhi', dept='marketting', dob=Date(11765), e_name='windy', salary=Decimal('4500'))

# alter table

In [40]:
row = session.execute("ALTER TABLE sg.emp ADD pin int;").all()
for i in row:
    print(i)

#  update and set

In [45]:
row = session.execute("UPDATE sg.emp SET pin=44009 WHERE e_id=3").one()

In [46]:
row = session.execute("SELECT * FROM sg.emp;").all()
for i in row:
    print(i)

Row(e_id=5, city='banglore', dept='Accountant', dob=Date(11245), e_name='jerry', pin=None, salary=Decimal('7500'))
Row(e_id=1, city='dehradun', dept='IT', dob=Date(10989), e_name='vini', pin=None, salary=Decimal('6500'))
Row(e_id=2, city='uttarakhand', dept='IT', dob=Date(10990), e_name='anu', pin=None, salary=Decimal('7500'))
Row(e_id=7, city='kolkata', dept='marketting', dob=Date(10603), e_name='oswald', pin=None, salary=Decimal('35'))
Row(e_id=6, city='chennai', dept='HR', dob=Date(12643), e_name='joy', pin=None, salary=Decimal('1500'))
Row(e_id=3, city='delhi', dept='marketting', dob=Date(11765), e_name='windy', pin=44009, salary=Decimal('4500'))

# ALIASES

In [47]:
row = session.execute("SELECT e_name AS name FROM sg.emp;").all()
for i in row:
    print(i)

Row(name='jerry')
Row(name='vini')
Row(name='anu')
Row(name='oswald')
Row(name='joy')
Row(name='windy')

#  count

In [79]:
row = session.execute("SELECT COUNT(* ) FROM sg.emp;").all()
print(row)

[Row(count=6)]

In [78]:
row = session.execute("SELECT COUNT(e_id) FROM sg.emp;").all()
print(row)

[Row(system_count_e_id=6)]

# avg

In [77]:
row = session.execute("SELECT AVG(salary ) FROM sg.emp;").all()
print(row)

[Row(system_avg_salary=Decimal('4589'))]

# sum

In [76]:
row = session.execute("SELECT SUM(salary ) FROM sg.emp;").all()
print(row)

[Row(system_sum_salary=Decimal('27535'))]

#  MAX

In [75]:
row = session.execute("SELECT MAX(salary ) FROM sg.emp;").all()
print(row)

[Row(system_max_salary=Decimal('7500'))]

# min

In [74]:
row = session.execute("SELECT MIN(salary ) FROM sg.emp;").all()
print(row)

[Row(system_min_salary=Decimal('35'))]